% мамина линия
родитель(кушковский_федор,кушковская_екатерина).
родитель(кушковская_ольга,кушковская_екатерина).

родитель(кушковская_екатерина, козлюк_нина).
родитель(кушковская_екатерина, козлюк_лиля).
родитель(кушковская_екатерина, козлюк_сергей).

родитель(козлюк_федор,козлюк_андрей).

родитель(козлюк_андрей, козлюк_нина).
родитель(козлюк_андрей, козлюк_лиля).
родитель(козлюк_андрей, козлюк_сергей).

родитель(рыбачок_григорий, рыбачок_анна).
родитель(рыбачок_степанида, рыбачок_анна).

родитель(рыбачок_анна, лавренчук_тамара).
родитель(рыбачок_анна, лавренчук_сергей_ст).
родитель(рыбачок_анна, лавренчук_михаил).

родитель(лавренчук_константин,лавренчук_алексей).
родитель(лавренчук_ирина,лавренчук_алексей).

родитель(лавренчук_константин,лавренчук_иван).
родитель(лавренчук_ирина,лавренчук_иван).

родитель(лавренчук_константин,лавренчук_илья).
родитель(лавренчук_ирина,лавренчук_илья).

родитель(лавренчук_константин,лавренчук_демитрий).
родитель(лавренчук_ирина,лавренчук_демитрий).

родитель(лавренчук_константин,лавренчук_нина).
родитель(лавренчук_ирина,лавренчук_нина).

родитель(лавренчук_константин,лавренчук_василий).
родитель(лавренчук_ирина,лавренчук_василий).

родитель(лавренчук_алексей, лавренчук_тамара).
родитель(лавренчук_алексей, лавренчук_сергей_ст).
родитель(лавренчук_алексей, лавренчук_михаил).

родитель(козлюк_нина,витвицкая_елена).
родитель(козлюк_лиля,труфанов_виталий).

родитель(козлюк_сергей, козлюк_татьяна).
родитель(козлюк_сергей, козлюк_александр).

родитель(лавренчук_тамара, козлюк_татьяна).
родитель(лавренчук_тамара, козлюк_александр).

родитель(лавренчук_сергей_ст, лавренчук_сергей_ил).
родитель(лавренчук_михаил, лавренчук_наталья).
родитель(лавренчук_михаил, лавренчук_александр).

родитель(яремко_олег, яремко_роман).
родитель(яремко_олег, яремко_максим).

родитель(козлюк_татьяна, яремко_роман).
родитель(козлюк_татьяна, яремко_максим).

родитель(козлюк_александр, козлюк_екатерина).
родитель(козлюк_александр, козлюк_ксения).

родитель(мищенко_виктория, козлюк_екатерина).
родитель(мищенко_виктория, козлюк_ксения).

%папина линия

родитель(яремко_прокоп,яремко_данила).
родитель(яремко_данила,яремко_иван).
родитель(яремко_иван,яремко_федор).
родитель(голяновский_иван,голяновский_иван).

родитель(яремко_федор,яремко_богдан).
родитель(байдук_варвара,яремко_богдан).

родитель(голяновский_роман,голяновская_тамара).
родитель(саламаха_ольга,голяновская_тамара).

родитель(яремко_богдан,яремко_лиля).
родитель(голяновская_тамара,яремко_лиля).
родитель(яремко_богдан,яремко_олег).
родитель(голяновская_тамара,яремко_олег).

родитель(яремко_лиля,музыка_варвара).
родитель(музыка_максим,музыка_варвара).

% а теперь пол

женский(кушковская_екатерина).
женский(рыбачок_анна).
женский(козлюк_нина).
женский(козлюк_лиля).
женский(лавренчук_тамара).
женский(витвицкая_елена).
женский(козлюк_татьяна).
женский(мищенко_виктория).
женский(лавренчук_наталья).
женский(козлюк_екатерина).
женский(козлюк_ксения).
женский(байдук_варвара).
женский(саламаха_ольга).
женский(голяновская_тамара).
женский(яремко_лиля).
женский(музыка_варвара).
женский(кушковская_ольга).
женский(рыбачок_степанида).
женский(лавренчук_ирина).
женский(лавренчук_нина).

мужской(козлюк_андрей).
мужской(лавренчук_алексей).
мужской(козлюк_сергей).
мужской(лавренчук_сергей_ст).
мужской(лавренчук_михаил).
мужской(труфанов_виталий).
мужской(яремко_олег).
мужской(козлюк_александр).
мужской(лавренчук_сергей_мл).
мужской(лавренчук_александр).
мужской(яремко_роман).
мужской(яремко_максим).
мужской(яремко_прокоп).
мужской(яремко_данила).
мужской(яремко_иван).
мужской(яремко_федор).
мужской(голяновский_роман).
мужской(голяновский_иван).
мужской(яремко_богдан).
мужской(музыка_максим).
мужской(кушковский_федор).
мужской(козлюк_федор).
мужской(рыбачок_григорий).
мужской(лавренчук_константин).
мужской(лавренчук_иван).
мужской(лавренчук_илья).
мужской(лавренчук_демитрий).
мужской(лавренчук_василий).

вБраке(яремко_олег,козлюк_татьяна).
вБраке(козлюк_александр,мищенко_виктория).
вБраке(козлюк_сергей,лавренчук_тамара).
вБраке(кушковская_екатерина,козлюк_андрей).
вБраке(рыбачок_анна,лавренчук_алексей).
вБраке(яремко_федор,байдук_варвара).
вБраке(голяновский_роман,саламаха_ольга).
вБраке(яремко_богдан,голяновская_тамара).
вБраке(яремко_лиля,музыка_максим).
вБраке(кушковский_федор,кушковский_ольга).
вБраке(рыбачок_степанида,рыбачок_григорий).
вБраке(лавренчук_константин,лавренчук_ирина).

% а теперь правила

супруги(А,Б) :- вБраке(А,Б);вБраке(Б,А).

мама(Мама,Некто) :- родитель(Мама, Некто),женский(Мама).
папа(Папа,Некто) :- родитель(Папа, Некто),мужской(Папа).

брат(Кому, Кто) :- Кому \== Кто,мужской(Кто),мама(Мама, Кому),мама(Мама, Кто),папа(Папа,Кому),папа(Папа, Кто).
сестра(Кому, Кто) :- Кому \== Кто,женский(Кто),мама(Мама, Кому),мама(Мама, Кто),папа(Папа,Кому),папа(Папа, Кто).

дочь(Родитель,Ребенок) :- женский(Ребенок),родитель(Родитель,Ребенок).
сын(Родитель,Ребенок) :- мужской(Ребенок),родитель(Родитель,Ребенок).

дядя(Дядя, Плем) :- родитель(Родитель, Плем),(брат(Родитель,Дядя);(сестра(Родитель,Сестра),супруги(Дядя,Сестра))),not(родитель(Дядя,Плем)).
тетя(Тетя,Плем) :- родитель(Родитель, Плем),(сестра(Родитель,Тетя);(брат(Родитель,Брат),супруги(Тетя,Брат))),not(родитель(Тетя,Плем)).

племянник(Плем, Кто) :- (дядя(Кто, Плем);тетя(Кто, Плем)),мужской(Плем).
племянница(Плем, Кто) :- (дядя(Кто, Плем);тетя(Кто, Плем)),женский(Плем).

бабушка(Бабушка,Внук) :- родитель(Х,Внук),родитель(Бабушка,Х),женский(Бабушка).
дедушка(Дедушка,Внук) :-родитель(Ъ,Внук),родитель(Дедушка,Ъ),мужской(Дедушка).

прабабушка(Бабушка,Внук) :- родитель(Х,Внук),бабушка(Бабушка,Х).
прадедушка(Дедушка,Внук) :- родитель(Ъ,Внук),дедушка(Дедушка,Ъ).

прапрабабушка(Бабушка,Внук) :- родитель(Х,Внук),прабабушка(Бабушка,Х).
прапрадедушка(Дедушка,Внук) :- родитель(Ъ,Внук),прадедушка(Дедушка,Ъ).

прапрапрабабушка(Бабушка,Внук) :- родитель(Х,Внук),прапрабабушка(Бабушка,Х).
прапрапрадедушка(Дедушка,Внук) :- родитель(Ъ,Внук),прапрадедушка(Дедушка,Ъ).

прапрапрапрадедушка(Дедушка,Внук) :- родитель(Ъ,Внук),прапрапрадедушка(Дедушка,Ъ).
